CLS
5 FOR I = 1 TO 30
10 READ A
20 IF A >= 90 THEN X = X + 1
21 IF A >= 80 AND A < 90 THEN Y = Y + 1
25 IF A > 59 AND A < 80 THEN S = S + 1
28 IF A < 60 THEN T = T + 1
30 NEXT I
40 DATA 37,89,93,74,81,97,98,100,78,87,56,66,77,88,99,87,86,85,84,90,90,98,89,78,69,70,50,80,78,67
PRINT "90分有:"; X, "80--89分有:"; Y, "60--79分有:"; S, "60分以下的有:"; T
PRINT "优生率是:"; INT(X / 30 * 10000) / 100; "%"
PRINT "良好率是:"; INT(Y / 30 * 10000) / 100; "%"
PRINT "达标率是:"; INT(S / 30 * 10000) / 100; "%"
PRINT "及格率是:"; INT((S + Y + X) / 30 * 10000) / 100; "%"
PRINT "不及格率是:"; INT(T / 30 * 10000) / 100; "%"
END



